tutorials/FSI/ampFsiFoam/axisymmetricTube/fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1736                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-14 1e-14 0);

boundaryField
{
    outlet
    {
        type fluxCorrectedVelocity;
    }
    inlet
    {
        type fluxCorrectedVelocity;
    }
    interface-fluid
    {
        type elasticWallVelocity;
        value uniform (0 0 0);
    }
    wedge_p
    {
        type wedge;
    }
    wedge_n
    {
        type wedge;
    }
}


// ************************************************************************* //
