tutorials/FSI/ampFsiFoam/axisymmetricTube/fluid/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch interface-solid;
solidZone interface-solid-zone;

fluidPatch interface-fluid;
fluidZone interface-fluid-zone;

relaxationFactor 0.1;
interfaceDeformationLimit 0;

outerCorrTolerance 1e-6;
nOuterCorr 1;

interpolatorUpdateFrequency 0;

//couplingScheme FixedRelaxation;
//couplingScheme Aitken;
couplingScheme IQN-ILS;
couplingReuse 0;

coupled yes;
predictor yes;

// ************************************************************************* //
