tutorials/FSI/ampFsiFoam/axisymmetricTube/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "0.0002/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3900;
    }
    interface-fluid
    {
        type            wall;
        nFaces          100;
        startFace       3920;
    }
    wedge_p
    {
        type            wedge;
        nFaces          2000;
        startFace       4020;
    }
    wedge_n
    {
        type            wedge;
        nFaces          2000;
        startFace       6020;
    }
)

// ************************************************************************* //
