tutorials/FSI/ampFsiFoam/axisymmetricTube/fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     D
//     {
//         solver          GAMG;
//         tolerance       1e-10;
//         relTol          0.1;
//         minIter         1;
//         maxIter         1000;
//         smoother        GaussSeidel;
//         nPreSweeps      0;
//         nPostSweeps     2;
//         nFinestSweeps   2;
//         scaleCorrection true;
//         directSolveCoarsest false;
//         cacheAgglomeration true;
//         nCellsInCoarsestLevel 20;
//         agglomerator    faceAreaPair;
//         mergeLevels     1;
//     }

    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    cellMotionU
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        minIter         1;
        maxIter         100;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          1e-6;
        minIter         1;
    }

    relaxationFactors
    {
        p 0.3;
        U 0.7;
    }
}

// ************************************************************************* //
